com.FlightBokingAPI/XmlFiles/Request-01.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:awsse="http://xml.amadeus.com/2010/06/Session_v3"
 xmlns:sec="http://xml.amadeus.com/2010/06/Security_v1"
 xmlns:typ="http://xml.amadeus.com/2010/06/Types_v1"
 xmlns:app="http://xml.amadeus.com/2010/06/AppMdw_CommonTypes_v3">
<s:Header>
    <a:MessageID xmlns:a="http://www.w3.org/2005/08/addressing">d4872254-c475-4b4e-a6b3-6a3d6e3c4d0e</a:MessageID>
    <a:Action xmlns:a="http://www.w3.org/2005/08/addressing">http://webservices.amadeus.com/FMPTBQ_23_4_1A</a:Action>
    <a:To xmlns:a="http://www.w3.org/2005/08/addressing">https://nodeD2.production.webservices.amadeus.com/1ASIWBYS9TF</a:To>
<Security xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
<oas:UsernameToken xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:oas1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" oas1:Id="UsernameToken-1"><oas:Username>WS9TFBYS </oas:Username><oas:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">ODm9evPz2FkT/MS2lovjIQ==</oas:Nonce> <oas:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">5vnBo/3koIKODhtKzfQWz7snlgg=</oas:Password><oas1:Created>2025-12-13T12:19:09+00:00</oas1:Created></oas:UsernameToken>
</Security>

<h:AMA_SecurityHostedUser xmlns:h="http://xml.amadeus.com/2010/06/Security_v1">
        <h:UserID POS_Type="1" 
                  PseudoCityCode="NBO4128DF" 
                  AgentDutyCode="SU" 
                  RequestorType="U" />
    </h:AMA_SecurityHostedUser>
</s:Header>
<s:Body>
<Fare_MasterPricerTravelBoardSearch xmlns="http://xml.amadeus.com/FMPTBQ_23_4_1A"><numberOfUnit><unitNumberDetail><numberOfUnits>250</numberOfUnits><typeOfUnit>RC</typeOfUnit></unitNumberDetail><unitNumberDetail><numberOfUnits>1</numberOfUnits><typeOfUnit>PX</typeOfUnit></unitNumberDetail></numberOfUnit><paxReference><ptc>IIT</ptc><ptc>ADT</ptc><traveller><ref>1</ref></traveller></paxReference><fareOptions><pricingTickInfo><pricingTicketing><priceType>TAC</priceType><priceType>RP</priceType><priceType>ET</priceType><priceType>RU</priceType><priceType>CUC</priceType><priceType>MNR</priceType><priceType>RW</priceType></pricingTicketing></pricingTickInfo><corporate><corporateId><corporateQualifier>RW</corporateQualifier><identity>387833</identity></corporateId></corporate><feeIdDescription><feeId><feeType>FFI</feeType><feeIdNumber>1</feeIdNumber></feeId></feeIdDescription><conversionRate><conversionRateDetail><currency>KES</currency></conversionRateDetail></conversionRate></fareOptions><travelFlightInfo><cabinId><cabinQualifier>RC</cabinQualifier><cabin>Y</cabin></cabinId></travelFlightInfo><itinerary><requestedSegmentRef><segRef>1</segRef></requestedSegmentRef><departureLocalization><departurePoint><locationId>DEL</locationId></departurePoint></departureLocalization><arrivalLocalization><arrivalPointDetails><locationId>DXB</locationId></arrivalPointDetails></arrivalLocalization><timeDetails><firstDateTimeDetail><date>010126</date></firstDateTimeDetail></timeDetails></itinerary></Fare_MasterPricerTravelBoardSearch>
</s:Body>
</s:Envelope>